Aymann00/STM32F446xx-Drivers/MCAL/DMA/Src/DMA_Program.c
/*
 ******************************************************************************
 * @file           : DMA_Program.c
 * @Author         : Mohammed Ayman Shalaby
 * @brief          : Main program body
 * @Date           : Jul 20, 2023
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 Ayman.
 * All rights reserved.
 *
 ******************************************************************************
 */

/*==============================================================================================================================================
 * INCLUDES SECTION START
 *==============================================================================================================================================*/
#include <stdint.h>

#include "../../../LIB/STM32F446xx.h"
#include "../../../LIB/ErrType.h"

#include "../Inc/DMA_Interface.h"
#include "../Inc/DMA_Private.h"

/*==============================================================================================================================================
 * INCLUDES SECTION END
 *==============================================================================================================================================*/

/*==============================================================================================================================================
 * GLOBAL VARIABLES SECTION START
 *==============================================================================================================================================*/

static void (*DMA1_STREAM_PTR_TOFUNC[8][DMA_INT_NUM])(void) = {NULL};
static void (*DMA2_STREAM_PTR_TOFUNC[8][DMA_INT_NUM])(void) = {NULL};

static DMA_RegDef_t *DMA[2] = {DMA1, DMA2};

/*==============================================================================================================================================
 * GLOBAL VARIABLES SECTION END
 *==============================================================================================================================================*/

/*==============================================================================================================================================
 * MODULES IMPLEMENTATION
 *==============================================================================================================================================*/

/**
 * @brief : The Function Clears A Specified  Interrupt Flag of A Specified Stream in a Certain DMA Controller of the Two DMA Controllers
 *
 * @param : DMAController => Enum that holds Options for Available DMA Controllers we have -> To choose Check enum ( @DMA_CONTROLLER_t )
 * @param : StreamNumber => Enum that holds Options for Available Streams in the DMA Controller -> Check Options ( @DMA_STREAMS_t )
 * @param : InterruptFlag => Enum that holds All Interrupt Flags that can Generate Interrupt in a Certain Stream -> Check Options ( @DMA_Interrupt_Flags_t )
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_ClearInterruptFlag(DMA_CONTROLLER_t DMAController, DMA_STREAMS_t StreamNumber, DMA_Interrupt_Flag_t InterruptFlag)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    uint8_t Local_u8RegisterShift = 0;

    if (StreamNumber < DMA_STREAM0 || StreamNumber > DMA_STREAM7 ||
        InterruptFlag < FIFO_ERROR_IT_FLAG || InterruptFlag > TRANSFER_COMPLETE_IT_FLAG ||
        DMAController < DMA1_CONTROLLER || DMAController > DMA2_CONTROLLER)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        /* Configurations Are Correct */

        if (StreamNumber % 2 == 0)
        {
            /* Even */
            Local_u8RegisterShift = 0;
        }
        else
        {
            /* Odd */
            Local_u8RegisterShift = 6;
        }

        DMA[DMAController]->IFCR[StreamNumber / 2] = (1 << InterruptFlag << Local_u8RegisterShift);
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : The Function Reads A Specified  Interrupt Flag of A Specified Stream in a Certain DMA Controller of the Two DMA Controllers
 *
 * @param : DMAController => Enum that holds Options for Available DMA Controllers we have -> To choose Check enum ( @DMA_CONTROLLER_t )
 * @param : StreamNumber => Enum that holds Options for Available Streams in the DMA Controller -> Check Options ( @DMA_STREAMS_t )
 * @param : InterruptFlag => Enum that holds All Interrupt Flags that can Generate Interrupt in a Certain Stream -> Check Options ( @DMA_Interrupt_Flags_t )
 * @param : InterruptFlagStatus => Pointer to a Variable that will hold the Status of the Interrupt Flag -> Check Options ( @DMA_Interrupt_Flag_Status_t )
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_ReadInterruptFlag(DMA_CONTROLLER_t DMAController, DMA_STREAMS_t StreamNumber, DMA_Interrupt_Flag_t InterruptFlag, DMA_Interrupt_Flag_Status_t *InterruptFlagStatus)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    uint8_t Local_u8RegisterShift = 0;

    if (StreamNumber < DMA_STREAM0 || StreamNumber > DMA_STREAM7 ||
        InterruptFlag < FIFO_ERROR_IT_FLAG || InterruptFlag > TRANSFER_COMPLETE_IT_FLAG ||
        DMAController < DMA1_CONTROLLER || DMAController > DMA2_CONTROLLER || InterruptFlagStatus == NULL)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        /* Configurations Are Correct */

        if (StreamNumber % 2 == 0)
        {
            /* Even */
            Local_u8RegisterShift = 0;
        }
        else
        {
            /* Odd */
            Local_u8RegisterShift = 6;
        }
        *InterruptFlagStatus = ((DMA[DMAController]->ISR[StreamNumber / 2] >> InterruptFlag >> Local_u8RegisterShift) & 0x01);
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : The Function Selects a Certain Channel on a Certain Stream in a Specifec DMA Controller
 *
 * @param : DMAController => Enum that holds Options for Available DMA Controllers we have -> To choose Check enum ( @DMA_CONTROLLER_t )
 * @param : StreamNumber => Enum that holds Options for Available Streams in the DMA Controller -> Check Options ( @DMA_STREAMS_t )
 * @param : ChannelNumber => Enum that holds All Possible Channels that can Request a Certain Stream -> Check Options ( @DMA_CHANNEL_t )
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_SetChannel(DMA_CONTROLLER_t DMAController, DMA_STREAMS_t StreamNumber, DMA_CHANNEL_t ChannelNumber)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    if (StreamNumber < DMA_STREAM0 || StreamNumber > DMA_STREAM7 ||
        ChannelNumber < DMA_CHANNEL0 || ChannelNumber > DMA_CHANNEL7 ||
        DMAController < DMA1_CONTROLLER || DMAController > DMA2_CONTROLLER)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        /* Configurations Are Correct */

        DMA[DMAController]->STREAM[StreamNumber].CR &= (DMA_CHSEL_MASK);
        DMA[DMAController]->STREAM[StreamNumber].CR |= (ChannelNumber << CHSEL);
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : The Function Set a Priority Level to a Certain Stream in a DMA Controller
 *
 * @param : DMAController => Enum that holds Options for Available DMA Controllers we have -> To choose Check enum ( @DMA_CONTROLLER_t )
 * @param : StreamNumber => Enum that holds Options for Available Streams in the DMA Controller -> Check Options ( @DMA_STREAMS_t )
 * @param : PriorityLevel => Enum that holds All Possible Values of Priority Levels you can give to a certain stream -> Check Options ( @DMA_PRIORITY_t )
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_SetStreamPriority(DMA_CONTROLLER_t DMAController, DMA_STREAMS_t StreamNumber, DMA_PRIORITY_t PriorityLevel)
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    if (DMAController < DMA1_CONTROLLER || DMAController > DMA2_CONTROLLER ||
        StreamNumber < DMA_STREAM0 || StreamNumber > DMA_STREAM7 ||
        PriorityLevel < DMA_LOW_PRIORITY || PriorityLevel > DMA_VERY_HIGH_PRIORITY)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        /* Configurations Are Correct */

        DMA[DMAController]->STREAM[StreamNumber].CR &= (DMA_PL_MASK);
        DMA[DMAController]->STREAM[StreamNumber].CR |= (PriorityLevel << PL);
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : This Function Initializes DMA with All Configurations User Choose Through Making a Structure & Passing It By Reference
 *
 * @param : Init => Pointer to Struct ( DMA_INIT_STRUCT_t ) This Struct Holds All Configurations of the DMA
 *            1- DMAController   => The Required DMA Controller to Use -> Check All Available DMA Controllers Options ( @DMA_CONTROLLER_t )
 *            2- StreamNumber    => The Required Stream to Use -> Check All Available Stream Options ( @DMA_STREAMS_t )
 *            3- ChannelNumber   => Channel To Select To Request A Certain Stream -> Check All Available Channels Options ( @DMA_CHANNEL_t )
 *            4- PeriphBurst     => Peripheral Burst Size to Choose -> Check All Available Options of Peripheral Burst ( @DMA_PERIPH_BURST_t )
 *            5- MemBurst        => Memory Burst Size to Choose -> Check All Available Options of Memory Burst ( @DMA_MEM_BURST_t )
 *            6- Priority        => Priority Level to Choose for a certain Stream -> Check All Available Options of Priority levels ( @DMA_PRIORITY_t )
 *            7- MemDataWidth    => Memory Data Width to Choose for the Data Transfer -> Check All Avaiable Options ( @DMA_MEM_WIDTH_t )
 *            8- PeriphDataWidth => Peripheral Data Width to Choose for the Data Transfer -> Check All Available Options ( @DMA_PERIPH_WIDTH_t )
 *            9- MemInc          => Memory Increment To Choose If you want to enable it or disable - > Check For Options ( @DMA_MINC_t )
 *           10- PeriphInc       => Peripheral Increment To Choose If you want to enable it or disable - > Check For Options ( @DMA_PINC_t )
 *           11- Mode            => To Specify Mode of the DMA to Choose Between Options -> Check For Options ( @DMA_MODE_t )
 *           12- Direction       => To Specify Data Transfer Direction -> Check For Options ( @DMA_DATA_DIRECTION_t )
 *           13- EnableIT        => Struct To Enable or Disable Multilple Interrupts -> Check For Options ( @DMA_INT_ENABLE_STRUCT_t )
 *           14- FIFOMode        => To Specify FIFO Mode if Enabled or NOT -> Check For Options ( @DMA_FIFO_MODE_t )
 *           15- FIFOThreshold   => To Specify FIFO Threshold Level  -> Check For Options ( @DMA_FIFO_THRESHOLD_t )
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_Init(DMA_INIT_STRUCT_t *Init)
{
    ERRORS_t Local_u8ErrorStatus = OK;

    if (DMA_NOK != DMA_CheckInitConfig(Init))
    {
        /* Configuration Are OK */

        /* Set Channel */
        DMA_SetChannel(Init->DMAController, Init->StreamNumber, Init->ChannelNumber);

        /* Set Memory Burst */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_MBURST_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->MemBurst << MBURST);

        /* Set Peripheral Burst */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_PBURST_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->PeriphBurst << PBURST);

        /* Set Priority Level */
        DMA_SetStreamPriority(Init->DMAController, Init->StreamNumber, Init->Priority);

        /* Set Memory Data Size */
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR &= (DMA_MSIZE_MASK);
        DMA[Init->DMAController]->STREAM[Init->StreamNumber].CR |= (Init->MemDataWidth << MSIZE);

