Aymann00/STM32F446xx-Drivers/MCAL/DMA/Src/DMA_Program.c
        /* Check on Modes */
        /* Set Destination & Source Address According to Data Transfer Direction */
        switch (InitConfig->Direction)
        {
        case DMA_PERIPH_TO_MEM:
        case DMA_MEM_TO_MEM:
            /* Set Source */
            DMA[InitConfig->DMAController]->STREAM[InitConfig->StreamNumber].PAR = (uint32_t)SrcAddress;

            /* Set Destination */
            DMA[InitConfig->DMAController]->STREAM[InitConfig->StreamNumber].M0AR = (uint32_t)DestAddress;
            break;

        case DMA_MEM_TO_PERIPH:
            /* Set Source */
            DMA[InitConfig->DMAController]->STREAM[InitConfig->StreamNumber].M0AR = (uint32_t)SrcAddress;

            /* Set Destination */
            DMA[InitConfig->DMAController]->STREAM[InitConfig->StreamNumber].PAR = (uint32_t)DestAddress;
            break;
        }

        /* Enable Stream */
        DMA[InitConfig->DMAController]->STREAM[InitConfig->StreamNumber].CR |= (1 << EN);
    }
    else
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief  : This Functoin Sets a CallBack Function to a Certain Interrupt
 * @fn     : DMA_SetCallBack
 * @param  : InitConfig => Struct that holds all configurations of the DMA -> Check Struct ( @DMA_INIT_STRUCT_t )
 * @param  : CallBackID => Enum that holds All Possible Interrupts that can Occur in a Certain Stream -> Check Options ( @DMA_CALLBACK_ID_t )
 * @param  : Copy_pvCallBack => Pointer to Function that will be Called when the Interrupt Occurs
 * @return : ERRORS_t => Error Status To Indicate if Function Worked Properly
 */
ERRORS_t DMA_SetCallBack(DMA_INIT_STRUCT_t *InitConfig, DMA_CALLBACK_ID_t CallBackID, void (*Copy_pvCallBack)(void))
{
    ERRORS_t Local_u8ErrorStatus = DMA_OK;

    if (DMA_NOK != DMA_CheckInitConfig(InitConfig))
    {
        if (CallBackID < DMA_TRANSFER_CMP_CALLBACK || CallBackID > DMA_FIFO_ERROR_CALLBACK || Copy_pvCallBack == NULL)
        {
            Local_u8ErrorStatus = DMA_NOK;
        }
        else
        {
            switch (InitConfig->DMAController)
            {
            case DMA1_CONTROLLER:
                DMA1_STREAM_PTR_TOFUNC[InitConfig->StreamNumber][CallBackID] = Copy_pvCallBack;
                break;

            case DMA2_CONTROLLER:
                DMA2_STREAM_PTR_TOFUNC[InitConfig->StreamNumber][CallBackID] = Copy_pvCallBack;
                break;
            }
        }
    }
    else
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    return Local_u8ErrorStatus;
}

/**
 * @brief : This Function Checks on the Configuration Structure of the DMA to Check if it's Valid or Not
 *
 * @param : DMA_InitConfig =>  Struct that holds all configurations of the DMA -> Check Struct ( @DMA_INIT_STRUCT_t )
 * @note  : This Function is a Private Function , Specified For Driver Use Only
 * @return: ERRORS_t => Error Status To Indicate if Function Worked Properly( DMA_OK ) or Not ( DMA_NOK )
 */
static ERRORS_t DMA_CheckInitConfig(DMA_INIT_STRUCT_t *DMA_InitConfig)
{
    ERRORS_t Local_u8ErrorStatus = OK;

    if (DMA_InitConfig->ChannelNumber < DMA_CHANNEL0 || DMA_InitConfig->ChannelNumber > DMA_CHANNEL7 ||
        DMA_InitConfig->Direction < DMA_PERIPH_TO_MEM || DMA_InitConfig->Direction > DMA_MEM_TO_MEM ||
        DMA_InitConfig->DMAController < DMA1_CONTROLLER || DMA_InitConfig->DMAController > DMA2_CONTROLLER ||
        DMA_InitConfig->FIFOMode < DMA_FIFOMODE_DISABLE || DMA_InitConfig->FIFOMode > DMA_FIFOMODE_ENABLE ||
        DMA_InitConfig->FIFOThreshold < DMA_FIFO_THRESHOLD_1QUARTER_FULL || DMA_InitConfig->FIFOThreshold > DMA_FIFO_THRESHOLD_FULL ||
        DMA_InitConfig->MemBurst < DMA_MEM_SINGLE_TRANSFER || DMA_InitConfig->MemBurst > DMA_MEM_BURST16_TRANSFER ||
        DMA_InitConfig->PeriphBurst < DMA_PERIPH_SINGLE_TRANSFER || DMA_InitConfig->PeriphBurst > DMA_PERIPH_BURST16_TRANSFER ||
        DMA_InitConfig->MemDataWidth < DMA_MEM_DATA_WIDTH_8BITS || DMA_InitConfig->MemDataWidth > DMA_MEM_DATA_WIDTH_32BITS ||
        DMA_InitConfig->MemInc < DMA_MINC_DISABLE || DMA_InitConfig->MemInc > DMA_MINC_ENABLE ||
        DMA_InitConfig->Mode < DMA_NORMAL || DMA_InitConfig->Mode > DMA_CIRCULAR ||
        DMA_InitConfig->PeriphDataWidth < DMA_PERIPH_DATA_WIDTH_8BITS || DMA_InitConfig->PeriphDataWidth > DMA_PERIPH_DATA_WIDTH_32BITS ||
        DMA_InitConfig->PeriphInc < DMA_PINC_DISABLE || DMA_InitConfig->PeriphInc > DMA_PINC_ENABLE ||
        DMA_InitConfig->Priority < DMA_LOW_PRIORITY || DMA_InitConfig->Priority > DMA_VERY_HIGH_PRIORITY ||
        DMA_InitConfig->StreamNumber < DMA_STREAM0 || DMA_InitConfig->StreamNumber > DMA_STREAM7)
    {
        Local_u8ErrorStatus = DMA_NOK;
    }
    else
    {
        Local_u8ErrorStatus = DMA_OK;
    }
    return Local_u8ErrorStatus;
}

/*==============================================================================================================================================
 * HANDLERS SECTION
 *==============================================================================================================================================*/

/* ==========================
 *           DMA1
 * ========================== */

void DMA1_Stream0_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM0, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM0, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM0][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM0][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream1_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM1, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

