Aymann00/STM32F446xx-Drivers/MCAL/DMA/Src/DMA_Program.c
        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM1, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM1][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM1][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream2_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM2, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM2, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM2][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM2][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream3_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM3, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM3, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM3][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM3][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream4_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM4, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM4, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM4][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM4][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream5_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM5, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM0, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM5][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM5][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream6_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM6, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM6, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM6][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM6][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA1_Stream7_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA1_CONTROLLER, DMA_STREAM7, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA1_CONTROLLER, DMA_STREAM7, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA1_STREAM_PTR_TOFUNC[DMA_STREAM7][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA1_STREAM_PTR_TOFUNC[DMA_STREAM7][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}

/* ==========================
 *           DMA2
 * ========================== */

void DMA2_Stream0_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM0, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM0, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM0][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM0][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA2_Stream1_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM1, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM1, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM1][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM1][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA2_Stream2_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM2, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM1, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM2][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM2][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA2_Stream3_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM3, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM3, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM3][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM3][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA2_Stream4_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM4, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM4, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM4][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM4][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA2_Stream5_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM5, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM5, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM5][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM5][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
void DMA2_Stream6_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM6, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM6, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM6][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM6][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}

void DMA2_Stream7_IRQHandler(void)
{
    DMA_Interrupt_Flag_Status_t FlagStatus = DMA_FLAG_RESET;

    DMA_ReadInterruptFlag(DMA2_CONTROLLER, DMA_STREAM7, TRANSFER_COMPLETE_IT_FLAG, &FlagStatus);

    if (FlagStatus == DMA_FLAG_SET)
    {
        /* Transfer Complete IT Occured */

        DMA_ClearInterruptFlag(DMA2_CONTROLLER, DMA_STREAM7, TRANSFER_COMPLETE_IT_FLAG);

        if (DMA2_STREAM_PTR_TOFUNC[DMA_STREAM7][DMA_TRANSFER_CMP_CALLBACK] != NULL)
        {
            DMA2_STREAM_PTR_TOFUNC[DMA_STREAM7][DMA_TRANSFER_CMP_CALLBACK]();
        }
    }
}
